{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_col": 5, "name": "convolution2d_1", "b_constraint": null, "border_mode": "valid", "trainable": true, "W_constraint": null, "nb_row": 5, "bias": true, "subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "batch_input_shape": [null, 70, 320, 3], "input_dtype": "float32", "b_regularizer": null, "nb_filter": 8, "W_regularizer": null, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_col": 5, "name": "convolution2d_2", "b_regularizer": null, "border_mode": "valid", "trainable": true, "W_constraint": null, "nb_row": 5, "bias": true, "subsample": [2, 2], "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_filter": 16, "W_regularizer": null, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_col": 5, "name": "convolution2d_3", "b_regularizer": null, "border_mode": "valid", "trainable": true, "W_constraint": null, "nb_row": 5, "bias": true, "subsample": [2, 2], "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_filter": 20, "W_regularizer": null, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_col": 5, "name": "convolution2d_4", "b_regularizer": null, "border_mode": "valid", "trainable": true, "W_constraint": null, "nb_row": 5, "bias": true, "subsample": [1, 2], "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_filter": 24, "W_regularizer": null, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_col": 5, "name": "convolution2d_5", "b_regularizer": null, "border_mode": "valid", "trainable": true, "W_constraint": null, "nb_row": 5, "bias": true, "subsample": [1, 2], "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_filter": 24, "W_regularizer": null, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_1", "activation": "tanh", "trainable": true, "W_constraint": null, "bias": true, "b_regularizer": null, "b_constraint": null, "input_dim": 2304, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.009999999776482582}, "output_dim": 30}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "p": 0.4}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_2", "activation": "tanh", "trainable": true, "W_constraint": null, "bias": true, "b_regularizer": null, "b_constraint": null, "input_dim": 30, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.009999999776482582}, "output_dim": 25}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "p": 0.3}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_3", "activation": "tanh", "trainable": true, "W_constraint": null, "bias": true, "b_regularizer": null, "b_constraint": null, "input_dim": 25, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.009999999776482582}, "output_dim": 20}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_8", "p": 0.2}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_4", "activation": "tanh", "trainable": true, "W_constraint": null, "bias": true, "b_regularizer": null, "b_constraint": null, "input_dim": 20, "activity_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.009999999776482582}, "output_dim": 1}}]}