{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "nb_row": 5, "batch_input_shape": [null, 70, 320, 3], "name": "convolution2d_1", "bias": true, "activation": "tanh", "border_mode": "valid", "b_constraint": null, "nb_filter": 6, "W_regularizer": null, "nb_col": 5, "input_dtype": "float32", "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [2, 2], "nb_row": 5, "name": "convolution2d_2", "bias": true, "activation": "tanh", "border_mode": "valid", "b_constraint": null, "nb_filter": 12, "W_regularizer": null, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [2, 2], "nb_row": 5, "name": "convolution2d_3", "bias": true, "activation": "tanh", "border_mode": "valid", "b_constraint": null, "nb_filter": 18, "W_regularizer": null, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 2], "nb_row": 5, "name": "convolution2d_4", "bias": true, "activation": "tanh", "border_mode": "valid", "b_constraint": null, "nb_filter": 24, "W_regularizer": null, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 2], "nb_row": 5, "name": "convolution2d_5", "bias": true, "activation": "tanh", "border_mode": "valid", "b_constraint": null, "nb_filter": 24, "W_regularizer": null, "nb_col": 5, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.009999999776482582, "l1": 0.0}, "output_dim": 30, "name": "dense_1", "bias": true, "activation": "tanh", "b_constraint": null, "input_dim": 2304, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.4, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"trainable": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.009999999776482582, "l1": 0.0}, "output_dim": 25, "name": "dense_2", "bias": true, "activation": "tanh", "b_constraint": null, "input_dim": 30, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.3, "name": "dropout_7"}}, {"class_name": "Dense", "config": {"trainable": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.009999999776482582, "l1": 0.0}, "output_dim": 20, "name": "dense_3", "bias": true, "activation": "tanh", "b_constraint": null, "input_dim": 25, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_8"}}, {"class_name": "Dense", "config": {"trainable": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.009999999776482582, "l1": 0.0}, "output_dim": 1, "name": "dense_4", "bias": true, "activation": "tanh", "b_constraint": null, "input_dim": 20, "b_regularizer": null, "activity_regularizer": null}}]}