{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "input_dtype": "float32", "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 10, "name": "convolution2d_1", "subsample": [1, 1], "nb_col": 5, "dim_ordering": "tf", "activation": "tanh", "batch_input_shape": [null, 160, 320, 3], "nb_row": 5, "W_constraint": null, "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "input_dtype": "float32", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activity_regularizer": null, "name": "dense_1", "W_regularizer": null, "output_dim": 32, "activation": "tanh", "input_dim": 492960, "batch_input_shape": [null, 492960], "W_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"bias": true, "input_dtype": "float32", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activity_regularizer": null, "name": "dense_2", "W_regularizer": null, "output_dim": 7, "activation": "softmax", "input_dim": 32, "batch_input_shape": [null, 32], "W_constraint": null, "b_regularizer": null}}]}