{"config": [{"config": {"activation": "tanh", "W_constraint": null, "b_regularizer": null, "nb_row": 5, "border_mode": "valid", "name": "convolution2d_1", "nb_col": 5, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "input_dtype": "float32", "nb_filter": 8, "b_constraint": null, "dim_ordering": "tf", "batch_input_shape": [null, 70, 320, 4], "trainable": true, "W_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "tanh", "b_regularizer": null, "nb_row": 5, "border_mode": "valid", "name": "convolution2d_2", "nb_col": 5, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "nb_filter": 16, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "trainable": true, "W_regularizer": null, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "tanh", "b_regularizer": null, "nb_row": 5, "border_mode": "valid", "name": "convolution2d_3", "nb_col": 5, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "nb_filter": 20, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "trainable": true, "W_regularizer": null, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "tanh", "b_regularizer": null, "nb_row": 5, "border_mode": "valid", "name": "convolution2d_4", "nb_col": 5, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "nb_filter": 24, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "trainable": true, "W_regularizer": null, "subsample": [1, 2]}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "tanh", "b_regularizer": null, "nb_row": 5, "border_mode": "valid", "name": "convolution2d_5", "nb_col": 5, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "nb_filter": 24, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "trainable": true, "W_regularizer": null, "subsample": [1, 2]}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "name": "dropout_5", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "tanh", "b_regularizer": null, "output_dim": 30, "name": "dense_1", "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "input_dim": 2304, "b_constraint": null, "W_constraint": null, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}}, "class_name": "Dense"}, {"config": {"p": 0.4, "name": "dropout_6", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "tanh", "b_regularizer": null, "output_dim": 25, "name": "dense_2", "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "input_dim": 30, "b_constraint": null, "W_constraint": null, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}}, "class_name": "Dense"}, {"config": {"p": 0.3, "name": "dropout_7", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "tanh", "b_regularizer": null, "output_dim": 20, "name": "dense_3", "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "input_dim": 25, "b_constraint": null, "W_constraint": null, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}}, "class_name": "Dense"}, {"config": {"p": 0.2, "name": "dropout_8", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "tanh", "b_regularizer": null, "output_dim": 2, "name": "dense_4", "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "input_dim": 20, "b_constraint": null, "W_constraint": null, "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}