{"keras_version": "1.2.1", "config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "activation": "tanh", "subsample": [1, 1], "trainable": true, "border_mode": "valid", "W_regularizer": null, "nb_filter": 6, "activity_regularizer": null, "bias": true, "input_dtype": "float32", "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_row": 5, "nb_col": 5, "b_regularizer": null, "W_constraint": null, "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"subsample": [2, 2], "activation": "tanh", "trainable": true, "border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "bias": true, "nb_filter": 12, "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_row": 5, "nb_col": 5, "b_regularizer": null, "W_constraint": null, "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"subsample": [2, 2], "activation": "tanh", "trainable": true, "border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "bias": true, "nb_filter": 18, "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_row": 5, "nb_col": 5, "b_regularizer": null, "W_constraint": null, "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"subsample": [2, 2], "activation": "tanh", "trainable": true, "border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "bias": true, "nb_filter": 24, "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_row": 5, "nb_col": 5, "b_regularizer": null, "W_constraint": null, "name": "convolution2d_4"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"subsample": [2, 2], "activation": "tanh", "trainable": true, "border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "bias": true, "nb_filter": 30, "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_row": 3, "nb_col": 5, "b_regularizer": null, "W_constraint": null, "name": "convolution2d_5"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_5", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"input_dim": 3360, "activation": "tanh", "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "activity_regularizer": null, "bias": true, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "output_dim": 180, "b_regularizer": null, "W_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_6", "p": 0.4}, "class_name": "Dropout"}, {"config": {"input_dim": 180, "activation": "tanh", "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "activity_regularizer": null, "bias": true, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "output_dim": 90, "b_regularizer": null, "W_constraint": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_7", "p": 0.3}, "class_name": "Dropout"}, {"config": {"input_dim": 90, "activation": "tanh", "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "activity_regularizer": null, "bias": true, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "output_dim": 30, "b_regularizer": null, "W_constraint": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_8", "p": 0.2}, "class_name": "Dropout"}, {"config": {"input_dim": 30, "activation": "softmax", "W_regularizer": {"l2": 0.009999999776482582, "l1": 0.0, "name": "L1L2Regularizer"}, "activity_regularizer": null, "bias": true, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "output_dim": 7, "b_regularizer": null, "W_constraint": null, "name": "dense_4"}, "class_name": "Dense"}], "class_name": "Sequential"}