{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activation": "tanh", "b_constraint": null, "W_regularizer": null, "batch_input_shape": [null, 70, 320, 3], "nb_row": 5, "init": "glorot_uniform", "nb_filter": 8, "nb_col": 5, "activity_regularizer": null, "b_regularizer": null, "input_dtype": "float32", "name": "convolution2d_1", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "activation": "tanh", "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "nb_filter": 16, "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_2", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "activation": "tanh", "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "nb_filter": 20, "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_3", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 2], "activation": "tanh", "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "nb_filter": 24, "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_4", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 2], "activation": "tanh", "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "nb_filter": 24, "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_5", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "tanh", "b_constraint": null, "input_dim": 2304, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_1", "trainable": true, "output_dim": 30, "W_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "p": 0.4}}, {"class_name": "Dense", "config": {"activation": "tanh", "b_constraint": null, "input_dim": 30, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_2", "trainable": true, "output_dim": 25, "W_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "p": 0.3}}, {"class_name": "Dense", "config": {"activation": "tanh", "b_constraint": null, "input_dim": 25, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_3", "trainable": true, "output_dim": 20, "W_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"activation": "tanh", "b_constraint": null, "input_dim": 20, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_4", "trainable": true, "output_dim": 1, "W_constraint": null, "bias": true}}], "keras_version": "1.2.1"}