{"keras_version": "1.2.1", "config": [{"config": {"nb_filter": 6, "bias": true, "subsample": [1, 1], "batch_input_shape": [null, 70, 320, 3], "trainable": true, "activity_regularizer": null, "input_dtype": "float32", "activation": "tanh", "nb_col": 5, "b_constraint": null, "name": "convolution2d_1", "init": "glorot_uniform", "nb_row": 5, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"nb_filter": 12, "bias": true, "subsample": [2, 2], "nb_col": 5, "trainable": true, "activity_regularizer": null, "dim_ordering": "tf", "activation": "tanh", "b_constraint": null, "name": "convolution2d_2", "init": "glorot_uniform", "nb_row": 5, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"nb_filter": 18, "bias": true, "subsample": [2, 2], "nb_col": 5, "trainable": true, "activity_regularizer": null, "dim_ordering": "tf", "activation": "tanh", "b_constraint": null, "name": "convolution2d_3", "init": "glorot_uniform", "nb_row": 5, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"nb_filter": 24, "bias": true, "subsample": [1, 2], "nb_col": 5, "trainable": true, "activity_regularizer": null, "dim_ordering": "tf", "activation": "tanh", "b_constraint": null, "name": "convolution2d_4", "init": "glorot_uniform", "nb_row": 5, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"nb_filter": 24, "bias": true, "subsample": [1, 2], "nb_col": 5, "trainable": true, "activity_regularizer": null, "dim_ordering": "tf", "activation": "tanh", "b_constraint": null, "name": "convolution2d_5", "init": "glorot_uniform", "nb_row": 5, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "activation": "tanh", "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_1", "input_dim": 2304, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "output_dim": 30}, "class_name": "Dense"}, {"config": {"p": 0.4, "trainable": true, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"bias": true, "activation": "tanh", "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_2", "input_dim": 30, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "output_dim": 25}, "class_name": "Dense"}, {"config": {"p": 0.3, "trainable": true, "name": "dropout_7"}, "class_name": "Dropout"}, {"config": {"bias": true, "activation": "tanh", "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_3", "input_dim": 25, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "output_dim": 20}, "class_name": "Dense"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_8"}, "class_name": "Dropout"}, {"config": {"bias": true, "activation": "tanh", "activity_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_4", "input_dim": 20, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential"}