{"config": [{"config": {"nb_row": 5, "b_regularizer": null, "activation": "tanh", "name": "convolution2d_1", "trainable": true, "bias": true, "W_regularizer": null, "W_constraint": null, "nb_col": 5, "input_dtype": "float32", "subsample": [1, 1], "nb_filter": 8, "batch_input_shape": [null, 70, 320, 4], "dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_row": 5, "b_regularizer": null, "activation": "tanh", "name": "convolution2d_2", "trainable": true, "bias": true, "W_regularizer": null, "W_constraint": null, "nb_col": 5, "subsample": [2, 2], "nb_filter": 16, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_row": 5, "b_regularizer": null, "activation": "tanh", "name": "convolution2d_3", "trainable": true, "bias": true, "W_regularizer": null, "W_constraint": null, "nb_col": 5, "subsample": [2, 2], "nb_filter": 20, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_row": 5, "b_regularizer": null, "activation": "tanh", "name": "convolution2d_4", "trainable": true, "bias": true, "W_regularizer": null, "W_constraint": null, "nb_col": 5, "subsample": [1, 2], "nb_filter": 24, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_row": 5, "b_regularizer": null, "activation": "tanh", "name": "convolution2d_5", "trainable": true, "bias": true, "W_regularizer": null, "W_constraint": null, "nb_col": 5, "subsample": [1, 2], "nb_filter": 24, "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_5", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "activation": "tanh", "name": "dense_1", "trainable": true, "bias": true, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "W_constraint": null, "activity_regularizer": null, "input_dim": 2304, "b_constraint": null, "init": "glorot_uniform", "output_dim": 30}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_6", "p": 0.4}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "activation": "tanh", "name": "dense_2", "trainable": true, "bias": true, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "W_constraint": null, "activity_regularizer": null, "input_dim": 30, "b_constraint": null, "init": "glorot_uniform", "output_dim": 25}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_7", "p": 0.3}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "activation": "tanh", "name": "dense_3", "trainable": true, "bias": true, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "W_constraint": null, "activity_regularizer": null, "input_dim": 25, "b_constraint": null, "init": "glorot_uniform", "output_dim": 20}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_8", "p": 0.2}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "activation": "tanh", "name": "dense_4", "trainable": true, "bias": true, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "W_constraint": null, "activity_regularizer": null, "input_dim": 20, "b_constraint": null, "init": "glorot_uniform", "output_dim": 2}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}