{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "tf", "batch_input_shape": [null, 70, 320, 4], "input_dtype": "float32", "bias": true, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "tanh", "nb_filter": 8, "nb_row": 5, "init": "glorot_uniform", "name": "convolution2d_1", "nb_col": 5, "b_constraint": null, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": null, "name": "convolution2d_2", "trainable": true, "activation": "tanh", "nb_filter": 16, "nb_row": 5, "init": "glorot_uniform", "nb_col": 5, "b_constraint": null, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": null, "name": "convolution2d_3", "trainable": true, "activation": "tanh", "nb_filter": 20, "nb_row": 5, "init": "glorot_uniform", "nb_col": 5, "b_constraint": null, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 2], "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": null, "name": "convolution2d_4", "trainable": true, "activation": "tanh", "nb_filter": 24, "nb_row": 5, "init": "glorot_uniform", "nb_col": 5, "b_constraint": null, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 2], "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": null, "name": "convolution2d_5", "trainable": true, "activation": "tanh", "nb_filter": 24, "nb_row": 5, "init": "glorot_uniform", "nb_col": 5, "b_constraint": null, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": 2304, "activity_regularizer": null, "b_regularizer": null, "bias": true, "output_dim": 30, "init": "glorot_uniform", "name": "dense_1", "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.009999999776482582}, "trainable": true, "activation": "tanh", "W_constraint": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "p": 0.4}}, {"class_name": "Dense", "config": {"input_dim": 30, "activity_regularizer": null, "b_regularizer": null, "bias": true, "output_dim": 25, "init": "glorot_uniform", "name": "dense_2", "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.009999999776482582}, "trainable": true, "activation": "tanh", "W_constraint": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "p": 0.3}}, {"class_name": "Dense", "config": {"input_dim": 25, "activity_regularizer": null, "b_regularizer": null, "bias": true, "output_dim": 20, "init": "glorot_uniform", "name": "dense_3", "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.009999999776482582}, "trainable": true, "activation": "tanh", "W_constraint": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_8", "p": 0.2}}, {"class_name": "Dense", "config": {"input_dim": 20, "activity_regularizer": null, "b_regularizer": null, "bias": true, "output_dim": 2, "init": "glorot_uniform", "name": "dense_4", "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.009999999776482582}, "trainable": true, "activation": "tanh", "W_constraint": null, "b_constraint": null}}]}