{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_row": 5, "activation": "tanh", "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 70, 320, 3], "W_constraint": null, "nb_col": 5, "subsample": [1, 1], "activity_regularizer": null, "border_mode": "valid", "bias": true, "name": "convolution2d_1", "nb_filter": 6}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_row": 5, "activation": "tanh", "dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "name": "convolution2d_2", "trainable": true, "W_constraint": null, "init": "glorot_uniform", "subsample": [2, 2], "activity_regularizer": null, "border_mode": "valid", "bias": true, "W_regularizer": null, "nb_filter": 12}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_row": 5, "activation": "tanh", "dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "name": "convolution2d_3", "trainable": true, "W_constraint": null, "init": "glorot_uniform", "subsample": [2, 2], "activity_regularizer": null, "border_mode": "valid", "bias": true, "W_regularizer": null, "nb_filter": 18}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_row": 5, "activation": "tanh", "dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "name": "convolution2d_4", "trainable": true, "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 2], "activity_regularizer": null, "border_mode": "valid", "bias": true, "W_regularizer": null, "nb_filter": 24}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_row": 5, "activation": "tanh", "dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "name": "convolution2d_5", "trainable": true, "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 2], "activity_regularizer": null, "border_mode": "valid", "bias": true, "W_regularizer": null, "nb_filter": 24}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "p": 0.5, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "tanh", "b_regularizer": null, "name": "dense_1", "trainable": true, "W_constraint": null, "input_dim": 2304, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "output_dim": 30}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "p": 0.4, "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "tanh", "b_regularizer": null, "name": "dense_2", "trainable": true, "W_constraint": null, "input_dim": 30, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "output_dim": 25}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "p": 0.3, "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "tanh", "b_regularizer": null, "name": "dense_3", "trainable": true, "W_constraint": null, "input_dim": 25, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "output_dim": 20}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "p": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "tanh", "b_regularizer": null, "name": "dense_4", "trainable": true, "W_constraint": null, "input_dim": 20, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "output_dim": 1}}]}