{"keras_version": "1.2.1", "config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "init": "glorot_uniform", "activation": "tanh", "nb_col": 5, "trainable": true, "activity_regularizer": null, "nb_filter": 6, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_1", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "nb_row": 5, "b_constraint": null, "bias": true, "input_dtype": "float32", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "activation": "tanh", "nb_col": 5, "trainable": true, "activity_regularizer": null, "nb_filter": 12, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_2", "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "nb_row": 5, "b_constraint": null, "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "activation": "tanh", "nb_col": 5, "trainable": true, "activity_regularizer": null, "nb_filter": 18, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_3", "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "nb_row": 5, "b_constraint": null, "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "activation": "tanh", "nb_col": 5, "trainable": true, "activity_regularizer": null, "nb_filter": 24, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_4", "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "nb_row": 5, "b_constraint": null, "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "activation": "tanh", "nb_col": 5, "trainable": true, "activity_regularizer": null, "nb_filter": 30, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_5", "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "nb_row": 3, "b_constraint": null, "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"input_dim": 3360, "init": "glorot_uniform", "activation": "tanh", "output_dim": 180, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "b_constraint": null, "bias": true, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"p": 0.4, "trainable": true, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"input_dim": 180, "init": "glorot_uniform", "activation": "tanh", "output_dim": 90, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "b_constraint": null, "bias": true, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"p": 0.3, "trainable": true, "name": "dropout_7"}, "class_name": "Dropout"}, {"config": {"input_dim": 90, "init": "glorot_uniform", "activation": "tanh", "output_dim": 30, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "b_constraint": null, "bias": true, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_8"}, "class_name": "Dropout"}, {"config": {"input_dim": 30, "init": "glorot_uniform", "activation": "softmax", "output_dim": 9, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "b_constraint": null, "bias": true, "name": "dense_4"}, "class_name": "Dense"}], "class_name": "Sequential"}