{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_regularizer": null, "input_dtype": "float32", "b_constraint": null, "batch_input_shape": [null, 70, 320, 4], "trainable": true, "b_regularizer": null, "name": "convolution2d_1", "bias": true, "activation": "tanh", "nb_row": 5, "nb_col": 5, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "W_constraint": null, "nb_filter": 8, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_regularizer": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "name": "convolution2d_2", "bias": true, "activation": "tanh", "nb_row": 5, "nb_col": 5, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [2, 2], "W_constraint": null, "nb_filter": 16, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_regularizer": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "name": "convolution2d_3", "bias": true, "activation": "tanh", "nb_row": 5, "nb_col": 5, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [2, 2], "W_constraint": null, "nb_filter": 20, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_regularizer": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "name": "convolution2d_4", "bias": true, "activation": "tanh", "nb_row": 5, "nb_col": 5, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 2], "W_constraint": null, "nb_filter": 24, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_regularizer": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "name": "convolution2d_5", "bias": true, "activation": "tanh", "nb_row": 5, "nb_col": 5, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 2], "W_constraint": null, "nb_filter": 24, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.009999999776482582}, "W_constraint": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "name": "dense_1", "bias": true, "activation": "tanh", "init": "glorot_uniform", "output_dim": 30, "input_dim": 2304, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "p": 0.4}}, {"class_name": "Dense", "config": {"W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.009999999776482582}, "W_constraint": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "name": "dense_2", "bias": true, "activation": "tanh", "init": "glorot_uniform", "output_dim": 25, "input_dim": 30, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "p": 0.3}}, {"class_name": "Dense", "config": {"W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.009999999776482582}, "W_constraint": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "name": "dense_3", "bias": true, "activation": "tanh", "init": "glorot_uniform", "output_dim": 20, "input_dim": 25, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_8", "p": 0.2}}, {"class_name": "Dense", "config": {"W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.009999999776482582}, "W_constraint": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "name": "dense_4", "bias": true, "activation": "tanh", "init": "glorot_uniform", "output_dim": 1, "input_dim": 20, "activity_regularizer": null}}]}